{
  "</box>": 151651,
  "</image>": 151647,
  "</image_id>": 151659,
  "</point>": 151655,
  "</quad>": 151653,
  "</ref>": 151649,
  "</slice>": 151657,
  "<box>": 151650,
  "<image>": 151646,
  "<image_id>": 151658,
  "<point>": 151654,
  "<quad>": 151652,
  "<ref>": 151648,
  "<slice>": 151656,
  "<|endoftext|>": 151643,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<gene>": 151660,
  "</gene>": 151661,
  "<gene_id>": 151662,
  "</gene_id>": 151663,
  "<|reserved_special_token_4|>": 151664,
  "<|reserved_special_token_5|>": 151665
}
