{
  "architectures": [
    "MiniCPMV"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_minicpm.MiniCPMVConfig",
    "AutoModel": "modeling_minicpmv.MiniCPMV",
    "AutoModelForCausalLM": "modeling_minicpmv.MiniCPMV"
  },
  "batch_vision_input": true,
  "bos_token_id": 151643,
  "drop_vision_last_layer": false,
  "dtype": "bfloat16",
  "eos_token_id": 151645,
  "gene_config": {
    "assay": true,
    "batch_first": true,
    "cls_classes": 164,
    "context_length": 1500,
    "dim_feedforward": 1024,
    "dim_model": 512,
    "dropout": 0.0,
    "learnable_pe": true,
    "masking_p": 0.15,
    "modality": true,
    "model_type": "nicheformer",
    "n_tokens": 20340,
    "nheads": 16,
    "nlayers": 12,
    "specie": true,
    "supervised_task": null
  },
  "gene_hidden_size": 512,
  "gene_max_length": 1500,
  "gene_vocab_size": 1536,
  "hidden_act": "silu",
  "hidden_size": 3584,
  "image_size": 448,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 32768,
  "max_window_layers": 28,
  "model_type": "minicpmv",
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "patch_size": 14,
  "query_num": 64,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "slice_config": {
    "max_slice_nums": 9,
    "model_type": "minicpmv",
    "patch_size": 14,
    "scale_resolution": 448
  },
  "slice_mode": true,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.1",
  "use_cache": true,
  "use_gene_module": true,
  "use_image_id": true,
  "use_sliding_window": false,
  "version": 2.6,
  "vision_batch_size": 16,
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 980,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 27,
    "patch_size": 14
  },
  "vocab_size": 151666
}
